Packet Tracer - Configuring Initial Switch Settings
===
### Topology
![topology][topology]

### Part 1
#### Step 1
1. Click S1 and then the CLI tab. Press Enter.
2. Enter privileged EXEC mode by entering the enable command.
<pre><code>Switch> enable
Switch#
</code></pre>

#### Step 2
1. Enter the show running-config command
<pre><code>Switch# show running-config</code></pre>
2. Answer:
    1. How many FastEthernet Interfaces does the switch have? **24 interfaces**
    2. How many Gigabit Ethernet interfaces does the switch have? **2 interfaces**
    3. What is the ranfe of values shown for the vty lines? **0-15**
    4. Which command will display the current contents of non-volatile random-access memory (NVRAM)? **Show startup-configuration**
    5. Why does the switch respond with _startup-config is not present_? **Because the configuration file is not saved in NVRAM**

### Part 2
#### Step 1
<pre><code>Switch# configure terminal
Switch(config)# hostname S1
S1(config)# exit
S1#
</code></pre>

#### Step 2
To secure access to the console line, access config-line mode and set the console password to letmein.
<pre><code>S1# configure terminal
S1(config)# line console 0
S1(config-line)# password letmein
S1(config-line)# login
S1(config-line)# end
</code></pre>
Why is the login command required? **It is needed for the password control to work**

#### Step 3
Verify the password
<pre><code>S1# exit
Password:
S1>
</code></pre>

#### Step 4
Set the enable password to c1$c0. This password protects access to privileged mode.
<pre><code>S1> enable
S1# configure terminal
S1(config)# enable password c1$c0
S1(config)# exit
</code></pre>

#### Step 5
Verify password
1... steps....5
**JUST USE:**
<pre><code>S1# show running-config</code></pre>

#### Step 6
The enable password should be replaced with the newer encrypted secret password using the enable secretcommand. Set the enable secretpassword to _itsasecret_.
<pre><code>S1# config t
S1(config)# enable secret itsasecret
S1(config)# exit
</code></pre>


#### Step 7
1. What is displayed for the enable secret password? **&lt;encrypted password&gt;**
2. Why is the enable secret password displayed differently from what we configured? **The enable secret password is encrypted. Thats why its displayed differently.**

#### Step 8
Encrypt the enable and console passwords
<pre><code>S1# config t
S1(config)# service password-encryption
S1(config)# exit
</code></pre>
If you configure any more passwords on the switch, will they be displayed in the configuration file as plain text or encrypted form? **It will encrypt ALL the current and future passwords**

### Part 3
#### Step 1
Configure a message of the day
<pre><code>S1# config t
S1(config)# banner motd "Hello"
S1(config)# exit
</code></pre>
1. When will this banner be displayed?
**Everytime a user access the switch via a cli.**
2. Why should every switch have a MOTD banner?
**To advert users that no authorized access its prohibited**

### Part 4
#### Step 2
Save the configuration file
<pre><code>S1# copy running-config startup-config</code></pre>

#### Step 3
Which command will display the contents of NVRAM? **Show startup-configuration**

Are all the changes that were entered recorded in the file? **Yes, its the same**


### Part 5
Configure Switch 2
..... **Packet tracer**

[topology]: ../../img/2_3_2_5_topology.png
