Packet Tracer - Implementing Basic Connectivity
===
### Topology
![topology][topology]
### Addressing Table
Device | Interface | IP Address  | Subnet Mask 
-------|-----------|-------------|-------------
S1     |VLAN 1     |192.168.1.253|255.255.255.0
S2     |VLAN 2     |192.168.1.254|255.255.255.0
PC1    |NIC        |192.168.1.1  |255.255.255.0
PC2    |NIC        |192.168.1.2  |255.255.255.0

### Part 1
#### Step 1
1. Click S1 and then clock the CLI tab
2. Enter the correct command to configure the hostname as S1
<pre><code>Switch> enable
Switch# configure
Switch(configure)# hostname S1
</code></pre>

#### Step 2
1. Use cisco for the console password
2. use class for the privileged EXEC mode password
<pre><code>S1> enable
S1# config
S1(config)# enable password cisco
S1(config)# enable secret class
S1(config)# end
</code></pre>

#### Step 3
How can you verify that both passwords were configured correctly? **Use _show run_ command**

#### Step 4
Use an appropriate banner text to warn unauthorized access.
<pre><code>S1> enable
S1# configure
S1(config)# banner motd #
YOU SHALL NOT PASS!!!!!!!!!!#
</code></pre>

#### Step 5
Which command do you issue to save the configuration file to NVRAM?
<pre><code>S1(config)# end
S1# copy run start
</code></pre>

### Part 2
#### Step 1
1. Click PC1 and then click the Desktop tab  
2. Click IP Configuration
3. Repeat steps for PC2
![packet tracer][part2]

#### Step 2
1. Click PC1. Click Command Prompt
2. Type ping command and the IP address for S1. Were you successful? **No, because we havent configured the switches**

### Part 3
#### Step 1
<pre><code>S1# configure terminal
S1(config)# interface vlan 1
S1(config-if)# ip address 192.168.1.253 255.255.255.0
S1(config-if)# no shutdown
S1(config-if)# exit
S1#
</code></pre>
Why do you enter the no shutdown command? **In order for have the management of the switch controlled through VLAN 1**

#### Step 3
Use the show ip interface brief to display the IP address and status of all the switch ports and interfaces.
![packet tracer][part3]

#### Step 4
Which command is used to save the configuration file in RAM to NVRAM? **copu running-config startup-config**

#### Step 5
1. Click PC1 and the click the Desktop tab.
2. Click Command Prompt.
3. Ping the IP address for PC2.
4. Ping the IP address for S1.
5. Ping the IP address for S2.

[topology]: ../../img/2_3_2_5_topology.png
[part2]: ../../img/packettracer23251.png
[part3]: ../../img/packettracer23252.png
